#+title: Myassemblyline

* Init
#+begin_src julia
import AssemblyLine2PC as AL2
# using Graphs, MetaGraphsNext
# using GraphPlot, Plots
# g = AL2.datatree()
## Current starters limit
N = 360+50*2
kk = AL2.autocomplete_keys();
VG = AL2.viewgraph();

## Use as: (to get autocompletion with kk.Ex<tab>)
# VG(kk.Explosive; speed = 15)
# VG(kk.Explosive; miners=N)

# ncell = AL2.recipe(kk.NCell; miners=N);
# AL2.resetspeed!(ncell, 8.5)

ncircuit = AL2.recipe(kk.NCircuit; miners=N);

#+end_src

#+RESULTS:

* Build graph
#+begin_src julia
viewg = AL2.viewgraph()
viewg(airb; miners = 311+46*2)

#+end_src

* Computer a top
** Chips

- Power Supply: 46 u/s
- Fan: 92 u/s
- Processor: 92 u/s

  Total: 230 u\s -> 46 packs of 5 makers
** Explosive 16u/s

- Circuit 80: 16x5 packs
  - Gold: 160: 32 miners
  - CopperWire 80: 16x5 packs (16 miners)
- Heater 160: 32x5 packs
  - Aluminium 640: 128 miners
  - IronWire 320: 16x20 packs (64 miners)
- CopperCable 160: 32x5 packs
  - CopperWire 480: 96x5 packs (96 miners)
- DiamondWire 160: 32x5 packs (32 miners)

+ CopperWire 80+480=560: 28x20 packs (112 miners)
+ DiamondWire 160: 8x20 packs (32 miners)
* Production real ratio
** Gold

| Starters | Speed u/s | Real Ratio |
|----------+-----------+------------|
|      100 |       460 |      4.600 |
|      200 |       920 |      4.600 |
|      300 |      1380 |      4.600 |
#+TBLFM: $4=$3/$2; %.3f

** Diamond 

| Starters | Speed u/s | Real Ratio | Real Production |
|----------+-----------+------------+-----------------|
|      100 |       460 |      4.600 |     0.217391300 |
|      150 |       690 |      4.600 |     0.217391300 |
|      200 |       920 |      4.600 |     0.217391300 |
|      250 |      1150 |      4.600 |     0.217391300 |
|      300 |      1380 |      4.600 |     0.217391300 |
#+TBLFM: $3=$2/$1; %.3f
#+TBLFM: $4=$1/$2; %.9f


